# მომხმარებელს შემოატანინეთ 5 რიცხვი
numbers = []
for i in range(5):
    num = int(input("შემოიტანეთ რიცხვი: "))
    numbers.append(num)

# გამოიყენეთ ყველა არითმეტიკული ოპერაცია
print("შედეგები:")
print("ჯამი:", sum(numbers))
print("სხვაობა:", numbers[0] - numbers[1])
print("ნამრავლი:", numbers[0] * numbers[1])
print("გაყოფა:", numbers[0] / numbers[1])
print("მთელი ნაწილი:", numbers[0] // numbers[1])
print("ნაშთი:", numbers[0] % numbers[1])

# შემოატანინეთ მომხმარებელს ასაკი
age = int(input("შემოიტანეთ თქვენი ასაკი: "))

# შეამოწმეთ არის თუ არა 18 წელზე მეტის და 20 წელზე ნაკლების
if 18 < age < 20:
    print("თქვენ 18 წელზე მეტი და 20 წელზე ნაკლები ხართ.")
else:
    print("თქვენ 18 წელზე მეტი და 20 წელზე ნაკლები არ ხართ.")

# ჩამოწერეთ ხუთ-ხუთი მაგალითი ყველა ლოგიკურ ოპერატორზე
print("ლოგიკური ოპერატორები")